2022-07/physics-based-dl/run/hyperparameter_pnnPotentialFoam/unit_box_domain/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       3890;
    }
    right
    {
        type            patch;
        nFaces          30;
        startFace       3950;
    }
    up
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       3980;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       4040;
    }
    cylinder
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          40;
        startFace       4070;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       4110;
    }
)

// ************************************************************************* //
